coupon을 얻고난 후 제출submit을 하면 
대략 3단계가 있다 
1) rate어쩌고 하면서 제출한 직후 10초를 기다리게 하는 것 
2) already submitted 하면서 거의 막바지까지 뜨는 내용 
3) 그리고 최종 expiration (정확히 45초) 
당연히 expiration한 이후에는 쿠폰 자체를 없애버리는 것이기 때문에 
재사용할 수 있는 권한은 없다 당연한 일이다 
그러면 논리적으로 따져 봤을 때 
already submitted < x < expiration 
이 사이에 거의 1~2초 차이를 두고 coupon을 다시 submit하는 타이밍이 
존재할 수도 있다 (실제로 이 가설은 맞았다)

실험 결과 : 쿠폰을 받은 후에 submit하고 int(time())이후 45초에 맞춰서 매우 근소하게 
쿠폰을 재차 submit 했다 그리고 받은 답은 "you already submitted" 어쩌고 하는 
답이 나왔다 

최종 실험 결과 : 정상적인 웹 페이지에서는 똑같은 가설을 여러번 실험했으나 효과가 없었다 
그러나 프록시 온을 한 상태로 버프로 웹 사이트를 열어놓은 뒤 정확히 같은 가설을 
실험했더니 바로 재사용 되면서 플래그를 획득하게 되었다 
